Sync: Compile latest build assets and update documentation
